GopalSaraf/Practicals/PSDL/include/proc/pic18f57q43.inc
// Register: DMA2PR
#define DMA2PR DMA2PR
DMA2PR                                   equ 00B7h
// bitfield definitions
DMA2PR_PR_POSN                           equ 0000h
DMA2PR_PR_POSITION                       equ 0000h
DMA2PR_PR_SIZE                           equ 0003h
DMA2PR_PR_LENGTH                         equ 0003h
DMA2PR_PR_MASK                           equ 0007h
DMA2PR_PR0_POSN                          equ 0000h
DMA2PR_PR0_POSITION                      equ 0000h
DMA2PR_PR0_SIZE                          equ 0001h
DMA2PR_PR0_LENGTH                        equ 0001h
DMA2PR_PR0_MASK                          equ 0001h
DMA2PR_PR1_POSN                          equ 0001h
DMA2PR_PR1_POSITION                      equ 0001h
DMA2PR_PR1_SIZE                          equ 0001h
DMA2PR_PR1_LENGTH                        equ 0001h
DMA2PR_PR1_MASK                          equ 0002h
DMA2PR_PR2_POSN                          equ 0002h
DMA2PR_PR2_POSITION                      equ 0002h
DMA2PR_PR2_SIZE                          equ 0001h
DMA2PR_PR2_LENGTH                        equ 0001h
DMA2PR_PR2_MASK                          equ 0004h
DMA2PR_DMA2PR_POSN                       equ 0000h
DMA2PR_DMA2PR_POSITION                   equ 0000h
DMA2PR_DMA2PR_SIZE                       equ 0003h
DMA2PR_DMA2PR_LENGTH                     equ 0003h
DMA2PR_DMA2PR_MASK                       equ 0007h
DMA2PR_DMA2PR0_POSN                      equ 0000h
DMA2PR_DMA2PR0_POSITION                  equ 0000h
DMA2PR_DMA2PR0_SIZE                      equ 0001h
DMA2PR_DMA2PR0_LENGTH                    equ 0001h
DMA2PR_DMA2PR0_MASK                      equ 0001h
DMA2PR_DMA2PR1_POSN                      equ 0001h
DMA2PR_DMA2PR1_POSITION                  equ 0001h
DMA2PR_DMA2PR1_SIZE                      equ 0001h
DMA2PR_DMA2PR1_LENGTH                    equ 0001h
DMA2PR_DMA2PR1_MASK                      equ 0002h
DMA2PR_DMA2PR2_POSN                      equ 0002h
DMA2PR_DMA2PR2_POSITION                  equ 0002h
DMA2PR_DMA2PR2_SIZE                      equ 0001h
DMA2PR_DMA2PR2_LENGTH                    equ 0001h
DMA2PR_DMA2PR2_MASK                      equ 0004h

// Register: DMA3PR
#define DMA3PR DMA3PR
DMA3PR                                   equ 00B8h
// bitfield definitions
DMA3PR_PR_POSN                           equ 0000h
DMA3PR_PR_POSITION                       equ 0000h
DMA3PR_PR_SIZE                           equ 0003h
DMA3PR_PR_LENGTH                         equ 0003h
DMA3PR_PR_MASK                           equ 0007h
DMA3PR_PR0_POSN                          equ 0000h
DMA3PR_PR0_POSITION                      equ 0000h
DMA3PR_PR0_SIZE                          equ 0001h
DMA3PR_PR0_LENGTH                        equ 0001h
DMA3PR_PR0_MASK                          equ 0001h
DMA3PR_PR1_POSN                          equ 0001h
DMA3PR_PR1_POSITION                      equ 0001h
DMA3PR_PR1_SIZE                          equ 0001h
DMA3PR_PR1_LENGTH                        equ 0001h
DMA3PR_PR1_MASK                          equ 0002h
DMA3PR_PR2_POSN                          equ 0002h
DMA3PR_PR2_POSITION                      equ 0002h
DMA3PR_PR2_SIZE                          equ 0001h
DMA3PR_PR2_LENGTH                        equ 0001h
DMA3PR_PR2_MASK                          equ 0004h
DMA3PR_DMA3PR_POSN                       equ 0000h
DMA3PR_DMA3PR_POSITION                   equ 0000h
DMA3PR_DMA3PR_SIZE                       equ 0003h
DMA3PR_DMA3PR_LENGTH                     equ 0003h
DMA3PR_DMA3PR_MASK                       equ 0007h
DMA3PR_DMA3PR0_POSN                      equ 0000h
DMA3PR_DMA3PR0_POSITION                  equ 0000h
DMA3PR_DMA3PR0_SIZE                      equ 0001h
DMA3PR_DMA3PR0_LENGTH                    equ 0001h
DMA3PR_DMA3PR0_MASK                      equ 0001h
DMA3PR_DMA3PR1_POSN                      equ 0001h
DMA3PR_DMA3PR1_POSITION                  equ 0001h
DMA3PR_DMA3PR1_SIZE                      equ 0001h
DMA3PR_DMA3PR1_LENGTH                    equ 0001h
DMA3PR_DMA3PR1_MASK                      equ 0002h
DMA3PR_DMA3PR2_POSN                      equ 0002h
DMA3PR_DMA3PR2_POSITION                  equ 0002h
DMA3PR_DMA3PR2_SIZE                      equ 0001h
DMA3PR_DMA3PR2_LENGTH                    equ 0001h
DMA3PR_DMA3PR2_MASK                      equ 0004h

// Register: DMA4PR
#define DMA4PR DMA4PR
DMA4PR                                   equ 00B9h
// bitfield definitions
DMA4PR_PR_POSN                           equ 0000h
DMA4PR_PR_POSITION                       equ 0000h
DMA4PR_PR_SIZE                           equ 0003h
DMA4PR_PR_LENGTH                         equ 0003h
DMA4PR_PR_MASK                           equ 0007h
DMA4PR_PR0_POSN                          equ 0000h
DMA4PR_PR0_POSITION                      equ 0000h
DMA4PR_PR0_SIZE                          equ 0001h
DMA4PR_PR0_LENGTH                        equ 0001h
DMA4PR_PR0_MASK                          equ 0001h
DMA4PR_PR1_POSN                          equ 0001h
DMA4PR_PR1_POSITION                      equ 0001h
DMA4PR_PR1_SIZE                          equ 0001h
DMA4PR_PR1_LENGTH                        equ 0001h
DMA4PR_PR1_MASK                          equ 0002h
DMA4PR_PR2_POSN                          equ 0002h
DMA4PR_PR2_POSITION                      equ 0002h
DMA4PR_PR2_SIZE                          equ 0001h
DMA4PR_PR2_LENGTH                        equ 0001h
DMA4PR_PR2_MASK                          equ 0004h
DMA4PR_DMA4PR_POSN                       equ 0000h
DMA4PR_DMA4PR_POSITION                   equ 0000h
DMA4PR_DMA4PR_SIZE                       equ 0003h
DMA4PR_DMA4PR_LENGTH                     equ 0003h
DMA4PR_DMA4PR_MASK                       equ 0007h
DMA4PR_DMA4PR0_POSN                      equ 0000h
DMA4PR_DMA4PR0_POSITION                  equ 0000h
DMA4PR_DMA4PR0_SIZE                      equ 0001h
DMA4PR_DMA4PR0_LENGTH                    equ 0001h
DMA4PR_DMA4PR0_MASK                      equ 0001h
DMA4PR_DMA4PR1_POSN                      equ 0001h
DMA4PR_DMA4PR1_POSITION                  equ 0001h
DMA4PR_DMA4PR1_SIZE                      equ 0001h
DMA4PR_DMA4PR1_LENGTH                    equ 0001h
DMA4PR_DMA4PR1_MASK                      equ 0002h
DMA4PR_DMA4PR2_POSN                      equ 0002h
DMA4PR_DMA4PR2_POSITION                  equ 0002h
DMA4PR_DMA4PR2_SIZE                      equ 0001h
DMA4PR_DMA4PR2_LENGTH                    equ 0001h
DMA4PR_DMA4PR2_MASK                      equ 0004h

// Register: DMA5PR
#define DMA5PR DMA5PR
DMA5PR                                   equ 00BAh
// bitfield definitions
DMA5PR_PR_POSN                           equ 0000h
DMA5PR_PR_POSITION                       equ 0000h
DMA5PR_PR_SIZE                           equ 0003h
DMA5PR_PR_LENGTH                         equ 0003h
DMA5PR_PR_MASK                           equ 0007h
DMA5PR_PR0_POSN                          equ 0000h
DMA5PR_PR0_POSITION                      equ 0000h
DMA5PR_PR0_SIZE                          equ 0001h
DMA5PR_PR0_LENGTH                        equ 0001h
DMA5PR_PR0_MASK                          equ 0001h
DMA5PR_PR1_POSN                          equ 0001h
DMA5PR_PR1_POSITION                      equ 0001h
DMA5PR_PR1_SIZE                          equ 0001h
DMA5PR_PR1_LENGTH                        equ 0001h
DMA5PR_PR1_MASK                          equ 0002h
DMA5PR_PR2_POSN                          equ 0002h
DMA5PR_PR2_POSITION                      equ 0002h
DMA5PR_PR2_SIZE                          equ 0001h
DMA5PR_PR2_LENGTH                        equ 0001h
DMA5PR_PR2_MASK                          equ 0004h
DMA5PR_DMA5PR_POSN                       equ 0000h
DMA5PR_DMA5PR_POSITION                   equ 0000h
DMA5PR_DMA5PR_SIZE                       equ 0003h
DMA5PR_DMA5PR_LENGTH                     equ 0003h
DMA5PR_DMA5PR_MASK                       equ 0007h
DMA5PR_DMA5PR0_POSN                      equ 0000h
DMA5PR_DMA5PR0_POSITION                  equ 0000h
DMA5PR_DMA5PR0_SIZE                      equ 0001h
DMA5PR_DMA5PR0_LENGTH                    equ 0001h
DMA5PR_DMA5PR0_MASK                      equ 0001h
DMA5PR_DMA5PR1_POSN                      equ 0001h
DMA5PR_DMA5PR1_POSITION                  equ 0001h
DMA5PR_DMA5PR1_SIZE                      equ 0001h
DMA5PR_DMA5PR1_LENGTH                    equ 0001h
DMA5PR_DMA5PR1_MASK                      equ 0002h
DMA5PR_DMA5PR2_POSN                      equ 0002h
DMA5PR_DMA5PR2_POSITION                  equ 0002h
DMA5PR_DMA5PR2_SIZE                      equ 0001h
DMA5PR_DMA5PR2_LENGTH                    equ 0001h
DMA5PR_DMA5PR2_MASK                      equ 0004h

