GopalSaraf/Practicals/PSDL/include/proc/pic18f57q43.inc
// Register: PIR5
#define PIR5 PIR5
PIR5                                     equ 04B3h
// bitfield definitions
PIR5_SPI2RXIF_POSN                       equ 0000h
PIR5_SPI2RXIF_POSITION                   equ 0000h
PIR5_SPI2RXIF_SIZE                       equ 0001h
PIR5_SPI2RXIF_LENGTH                     equ 0001h
PIR5_SPI2RXIF_MASK                       equ 0001h
PIR5_SPI2TXIF_POSN                       equ 0001h
PIR5_SPI2TXIF_POSITION                   equ 0001h
PIR5_SPI2TXIF_SIZE                       equ 0001h
PIR5_SPI2TXIF_LENGTH                     equ 0001h
PIR5_SPI2TXIF_MASK                       equ 0002h
PIR5_SPI2IF_POSN                         equ 0002h
PIR5_SPI2IF_POSITION                     equ 0002h
PIR5_SPI2IF_SIZE                         equ 0001h
PIR5_SPI2IF_LENGTH                       equ 0001h
PIR5_SPI2IF_MASK                         equ 0004h
PIR5_TMR3IF_POSN                         equ 0004h
PIR5_TMR3IF_POSITION                     equ 0004h
PIR5_TMR3IF_SIZE                         equ 0001h
PIR5_TMR3IF_LENGTH                       equ 0001h
PIR5_TMR3IF_MASK                         equ 0010h
PIR5_TMR3GIF_POSN                        equ 0005h
PIR5_TMR3GIF_POSITION                    equ 0005h
PIR5_TMR3GIF_SIZE                        equ 0001h
PIR5_TMR3GIF_LENGTH                      equ 0001h
PIR5_TMR3GIF_MASK                        equ 0020h
PIR5_PWM2PIF_POSN                        equ 0006h
PIR5_PWM2PIF_POSITION                    equ 0006h
PIR5_PWM2PIF_SIZE                        equ 0001h
PIR5_PWM2PIF_LENGTH                      equ 0001h
PIR5_PWM2PIF_MASK                        equ 0040h
PIR5_PWM2IF_POSN                         equ 0007h
PIR5_PWM2IF_POSITION                     equ 0007h
PIR5_PWM2IF_SIZE                         equ 0001h
PIR5_PWM2IF_LENGTH                       equ 0001h
PIR5_PWM2IF_MASK                         equ 0080h

// Register: PIR6
#define PIR6 PIR6
PIR6                                     equ 04B4h
// bitfield definitions
PIR6_INT1IF_POSN                         equ 0000h
PIR6_INT1IF_POSITION                     equ 0000h
PIR6_INT1IF_SIZE                         equ 0001h
PIR6_INT1IF_LENGTH                       equ 0001h
PIR6_INT1IF_MASK                         equ 0001h
PIR6_CLC2IF_POSN                         equ 0001h
PIR6_CLC2IF_POSITION                     equ 0001h
PIR6_CLC2IF_SIZE                         equ 0001h
PIR6_CLC2IF_LENGTH                       equ 0001h
PIR6_CLC2IF_MASK                         equ 0002h
PIR6_CWG1IF_POSN                         equ 0002h
PIR6_CWG1IF_POSITION                     equ 0002h
PIR6_CWG1IF_SIZE                         equ 0001h
PIR6_CWG1IF_LENGTH                       equ 0001h
PIR6_CWG1IF_MASK                         equ 0004h
PIR6_NCO1IF_POSN                         equ 0003h
PIR6_NCO1IF_POSITION                     equ 0003h
PIR6_NCO1IF_SIZE                         equ 0001h
PIR6_NCO1IF_LENGTH                       equ 0001h
PIR6_NCO1IF_MASK                         equ 0008h
PIR6_DMA2SCNTIF_POSN                     equ 0004h
PIR6_DMA2SCNTIF_POSITION                 equ 0004h
PIR6_DMA2SCNTIF_SIZE                     equ 0001h
PIR6_DMA2SCNTIF_LENGTH                   equ 0001h
PIR6_DMA2SCNTIF_MASK                     equ 0010h
PIR6_DMA2DCNTIF_POSN                     equ 0005h
PIR6_DMA2DCNTIF_POSITION                 equ 0005h
PIR6_DMA2DCNTIF_SIZE                     equ 0001h
PIR6_DMA2DCNTIF_LENGTH                   equ 0001h
PIR6_DMA2DCNTIF_MASK                     equ 0020h
PIR6_DMA2ORIF_POSN                       equ 0006h
PIR6_DMA2ORIF_POSITION                   equ 0006h
PIR6_DMA2ORIF_SIZE                       equ 0001h
PIR6_DMA2ORIF_LENGTH                     equ 0001h
PIR6_DMA2ORIF_MASK                       equ 0040h
PIR6_DMA2AIF_POSN                        equ 0007h
PIR6_DMA2AIF_POSITION                    equ 0007h
PIR6_DMA2AIF_SIZE                        equ 0001h
PIR6_DMA2AIF_LENGTH                      equ 0001h
PIR6_DMA2AIF_MASK                        equ 0080h

// Register: PIR7
#define PIR7 PIR7
PIR7                                     equ 04B5h
// bitfield definitions
PIR7_I2C1RXIF_POSN                       equ 0000h
PIR7_I2C1RXIF_POSITION                   equ 0000h
PIR7_I2C1RXIF_SIZE                       equ 0001h
PIR7_I2C1RXIF_LENGTH                     equ 0001h
PIR7_I2C1RXIF_MASK                       equ 0001h
PIR7_I2C1TXIF_POSN                       equ 0001h
PIR7_I2C1TXIF_POSITION                   equ 0001h
PIR7_I2C1TXIF_SIZE                       equ 0001h
PIR7_I2C1TXIF_LENGTH                     equ 0001h
PIR7_I2C1TXIF_MASK                       equ 0002h
PIR7_I2C1IF_POSN                         equ 0002h
PIR7_I2C1IF_POSITION                     equ 0002h
PIR7_I2C1IF_SIZE                         equ 0001h
PIR7_I2C1IF_LENGTH                       equ 0001h
PIR7_I2C1IF_MASK                         equ 0004h
PIR7_I2C1EIF_POSN                        equ 0003h
PIR7_I2C1EIF_POSITION                    equ 0003h
PIR7_I2C1EIF_SIZE                        equ 0001h
PIR7_I2C1EIF_LENGTH                      equ 0001h
PIR7_I2C1EIF_MASK                        equ 0008h
PIR7_CLC3IF_POSN                         equ 0005h
PIR7_CLC3IF_POSITION                     equ 0005h
PIR7_CLC3IF_SIZE                         equ 0001h
PIR7_CLC3IF_LENGTH                       equ 0001h
PIR7_CLC3IF_MASK                         equ 0020h
PIR7_PWM3PIF_POSN                        equ 0006h
PIR7_PWM3PIF_POSITION                    equ 0006h
PIR7_PWM3PIF_SIZE                        equ 0001h
PIR7_PWM3PIF_LENGTH                      equ 0001h
PIR7_PWM3PIF_MASK                        equ 0040h
PIR7_PWM3IF_POSN                         equ 0007h
PIR7_PWM3IF_POSITION                     equ 0007h
PIR7_PWM3IF_SIZE                         equ 0001h
PIR7_PWM3IF_LENGTH                       equ 0001h
PIR7_PWM3IF_MASK                         equ 0080h

// Register: PIR8
#define PIR8 PIR8
PIR8                                     equ 04B6h
// bitfield definitions
PIR8_U2RXIF_POSN                         equ 0000h
PIR8_U2RXIF_POSITION                     equ 0000h
PIR8_U2RXIF_SIZE                         equ 0001h
PIR8_U2RXIF_LENGTH                       equ 0001h
PIR8_U2RXIF_MASK                         equ 0001h
PIR8_U2TXIF_POSN                         equ 0001h
PIR8_U2TXIF_POSITION                     equ 0001h
PIR8_U2TXIF_SIZE                         equ 0001h
PIR8_U2TXIF_LENGTH                       equ 0001h
PIR8_U2TXIF_MASK                         equ 0002h
PIR8_U2EIF_POSN                          equ 0002h
PIR8_U2EIF_POSITION                      equ 0002h
PIR8_U2EIF_SIZE                          equ 0001h
PIR8_U2EIF_LENGTH                        equ 0001h
PIR8_U2EIF_MASK                          equ 0004h
PIR8_U2IF_POSN                           equ 0003h
PIR8_U2IF_POSITION                       equ 0003h
PIR8_U2IF_SIZE                           equ 0001h
PIR8_U2IF_LENGTH                         equ 0001h
PIR8_U2IF_MASK                           equ 0008h
PIR8_TMR5IF_POSN                         equ 0004h
PIR8_TMR5IF_POSITION                     equ 0004h
PIR8_TMR5IF_SIZE                         equ 0001h
PIR8_TMR5IF_LENGTH                       equ 0001h
PIR8_TMR5IF_MASK                         equ 0010h
PIR8_TMR5GIF_POSN                        equ 0005h
PIR8_TMR5GIF_POSITION                    equ 0005h
PIR8_TMR5GIF_SIZE                        equ 0001h
PIR8_TMR5GIF_LENGTH                      equ 0001h
PIR8_TMR5GIF_MASK                        equ 0020h
PIR8_CCP2IF_POSN                         equ 0006h
PIR8_CCP2IF_POSITION                     equ 0006h
PIR8_CCP2IF_SIZE                         equ 0001h
PIR8_CCP2IF_LENGTH                       equ 0001h
PIR8_CCP2IF_MASK                         equ 0040h
PIR8_SCANIF_POSN                         equ 0007h
PIR8_SCANIF_POSITION                     equ 0007h
PIR8_SCANIF_SIZE                         equ 0001h
PIR8_SCANIF_LENGTH                       equ 0001h
PIR8_SCANIF_MASK                         equ 0080h

// Register: PIR9
#define PIR9 PIR9
PIR9                                     equ 04B7h
// bitfield definitions
PIR9_U3RXIF_POSN                         equ 0000h
PIR9_U3RXIF_POSITION                     equ 0000h
PIR9_U3RXIF_SIZE                         equ 0001h
PIR9_U3RXIF_LENGTH                       equ 0001h
PIR9_U3RXIF_MASK                         equ 0001h
PIR9_U3TXIF_POSN                         equ 0001h
PIR9_U3TXIF_POSITION                     equ 0001h
PIR9_U3TXIF_SIZE                         equ 0001h
PIR9_U3TXIF_LENGTH                       equ 0001h
PIR9_U3TXIF_MASK                         equ 0002h
PIR9_U3EIF_POSN                          equ 0002h
PIR9_U3EIF_POSITION                      equ 0002h
PIR9_U3EIF_SIZE                          equ 0001h
PIR9_U3EIF_LENGTH                        equ 0001h
PIR9_U3EIF_MASK                          equ 0004h
PIR9_U3IF_POSN                           equ 0003h
PIR9_U3IF_POSITION                       equ 0003h
PIR9_U3IF_SIZE                           equ 0001h
PIR9_U3IF_LENGTH                         equ 0001h
PIR9_U3IF_MASK                           equ 0008h
PIR9_CLC4IF_POSN                         equ 0005h
PIR9_CLC4IF_POSITION                     equ 0005h
PIR9_CLC4IF_SIZE                         equ 0001h
PIR9_CLC4IF_LENGTH                       equ 0001h
PIR9_CLC4IF_MASK                         equ 0020h

// Register: PIR10
#define PIR10 PIR10
PIR10                                    equ 04B8h
// bitfield definitions
PIR10_INT2IF_POSN                        equ 0000h
PIR10_INT2IF_POSITION                    equ 0000h
PIR10_INT2IF_SIZE                        equ 0001h
PIR10_INT2IF_LENGTH                      equ 0001h
PIR10_INT2IF_MASK                        equ 0001h
PIR10_CLC5IF_POSN                        equ 0001h
PIR10_CLC5IF_POSITION                    equ 0001h
PIR10_CLC5IF_SIZE                        equ 0001h
PIR10_CLC5IF_LENGTH                      equ 0001h
PIR10_CLC5IF_MASK                        equ 0002h
PIR10_CWG2IF_POSN                        equ 0002h
PIR10_CWG2IF_POSITION                    equ 0002h
PIR10_CWG2IF_SIZE                        equ 0001h
PIR10_CWG2IF_LENGTH                      equ 0001h
PIR10_CWG2IF_MASK                        equ 0004h
PIR10_NCO2IF_POSN                        equ 0003h
PIR10_NCO2IF_POSITION                    equ 0003h
PIR10_NCO2IF_SIZE                        equ 0001h
PIR10_NCO2IF_LENGTH                      equ 0001h
PIR10_NCO2IF_MASK                        equ 0008h
PIR10_DMA3SCNTIF_POSN                    equ 0004h
PIR10_DMA3SCNTIF_POSITION                equ 0004h
PIR10_DMA3SCNTIF_SIZE                    equ 0001h
PIR10_DMA3SCNTIF_LENGTH                  equ 0001h
PIR10_DMA3SCNTIF_MASK                    equ 0010h
PIR10_DMA3DCNTIF_POSN                    equ 0005h
PIR10_DMA3DCNTIF_POSITION                equ 0005h
PIR10_DMA3DCNTIF_SIZE                    equ 0001h
PIR10_DMA3DCNTIF_LENGTH                  equ 0001h
PIR10_DMA3DCNTIF_MASK                    equ 0020h
PIR10_DMA3ORIF_POSN                      equ 0006h
PIR10_DMA3ORIF_POSITION                  equ 0006h
PIR10_DMA3ORIF_SIZE                      equ 0001h
PIR10_DMA3ORIF_LENGTH                    equ 0001h
PIR10_DMA3ORIF_MASK                      equ 0040h
PIR10_DMA3AIF_POSN                       equ 0007h
PIR10_DMA3AIF_POSITION                   equ 0007h
PIR10_DMA3AIF_SIZE                       equ 0001h
PIR10_DMA3AIF_LENGTH                     equ 0001h
PIR10_DMA3AIF_MASK                       equ 0080h

// Register: PIR11
#define PIR11 PIR11
PIR11                                    equ 04B9h
// bitfield definitions
PIR11_CCP3IF_POSN                        equ 0000h
PIR11_CCP3IF_POSITION                    equ 0000h
PIR11_CCP3IF_SIZE                        equ 0001h
PIR11_CCP3IF_LENGTH                      equ 0001h
PIR11_CCP3IF_MASK                        equ 0001h
PIR11_CLC6IF_POSN                        equ 0001h
PIR11_CLC6IF_POSITION                    equ 0001h
PIR11_CLC6IF_SIZE                        equ 0001h
PIR11_CLC6IF_LENGTH                      equ 0001h
PIR11_CLC6IF_MASK                        equ 0002h
PIR11_CWG3IF_POSN                        equ 0002h
PIR11_CWG3IF_POSITION                    equ 0002h
PIR11_CWG3IF_SIZE                        equ 0001h
PIR11_CWG3IF_LENGTH                      equ 0001h
PIR11_CWG3IF_MASK                        equ 0004h
PIR11_TMR4IF_POSN                        equ 0003h
PIR11_TMR4IF_POSITION                    equ 0003h
PIR11_TMR4IF_SIZE                        equ 0001h
PIR11_TMR4IF_LENGTH                      equ 0001h
PIR11_TMR4IF_MASK                        equ 0008h
PIR11_DMA4SCNTIF_POSN                    equ 0004h
PIR11_DMA4SCNTIF_POSITION                equ 0004h
PIR11_DMA4SCNTIF_SIZE                    equ 0001h
PIR11_DMA4SCNTIF_LENGTH                  equ 0001h
PIR11_DMA4SCNTIF_MASK                    equ 0010h
PIR11_DMA4DCNTIF_POSN                    equ 0005h
PIR11_DMA4DCNTIF_POSITION                equ 0005h
PIR11_DMA4DCNTIF_SIZE                    equ 0001h
PIR11_DMA4DCNTIF_LENGTH                  equ 0001h
PIR11_DMA4DCNTIF_MASK                    equ 0020h
PIR11_DMA4ORIF_POSN                      equ 0006h
PIR11_DMA4ORIF_POSITION                  equ 0006h
PIR11_DMA4ORIF_SIZE                      equ 0001h
PIR11_DMA4ORIF_LENGTH                    equ 0001h
PIR11_DMA4ORIF_MASK                      equ 0040h
PIR11_DMA4AIF_POSN                       equ 0007h
PIR11_DMA4AIF_POSITION                   equ 0007h
PIR11_DMA4AIF_SIZE                       equ 0001h
PIR11_DMA4AIF_LENGTH                     equ 0001h
PIR11_DMA4AIF_MASK                       equ 0080h

// Register: PIR12
#define PIR12 PIR12
PIR12                                    equ 04BAh
// bitfield definitions
PIR12_U4RXIF_POSN                        equ 0000h
PIR12_U4RXIF_POSITION                    equ 0000h
PIR12_U4RXIF_SIZE                        equ 0001h
PIR12_U4RXIF_LENGTH                      equ 0001h
PIR12_U4RXIF_MASK                        equ 0001h
PIR12_U4TXIF_POSN                        equ 0001h
PIR12_U4TXIF_POSITION                    equ 0001h
PIR12_U4TXIF_SIZE                        equ 0001h
PIR12_U4TXIF_LENGTH                      equ 0001h
PIR12_U4TXIF_MASK                        equ 0002h
PIR12_U4EIF_POSN                         equ 0002h
PIR12_U4EIF_POSITION                     equ 0002h
PIR12_U4EIF_SIZE                         equ 0001h
PIR12_U4EIF_LENGTH                       equ 0001h
PIR12_U4EIF_MASK                         equ 0004h
PIR12_U4IF_POSN                          equ 0003h
PIR12_U4IF_POSITION                      equ 0003h
PIR12_U4IF_SIZE                          equ 0001h
PIR12_U4IF_LENGTH                        equ 0001h
PIR12_U4IF_MASK                          equ 0008h
PIR12_DMA5SCNTIF_POSN                    equ 0004h
PIR12_DMA5SCNTIF_POSITION                equ 0004h
PIR12_DMA5SCNTIF_SIZE                    equ 0001h
PIR12_DMA5SCNTIF_LENGTH                  equ 0001h
PIR12_DMA5SCNTIF_MASK                    equ 0010h
PIR12_DMA5DCNTIF_POSN                    equ 0005h
PIR12_DMA5DCNTIF_POSITION                equ 0005h
PIR12_DMA5DCNTIF_SIZE                    equ 0001h
PIR12_DMA5DCNTIF_LENGTH                  equ 0001h
PIR12_DMA5DCNTIF_MASK                    equ 0020h
PIR12_DMA5ORIF_POSN                      equ 0006h
PIR12_DMA5ORIF_POSITION                  equ 0006h
PIR12_DMA5ORIF_SIZE                      equ 0001h
PIR12_DMA5ORIF_LENGTH                    equ 0001h
PIR12_DMA5ORIF_MASK                      equ 0040h
PIR12_DMA5AIF_POSN                       equ 0007h
PIR12_DMA5AIF_POSITION                   equ 0007h
PIR12_DMA5AIF_SIZE                       equ 0001h
PIR12_DMA5AIF_LENGTH                     equ 0001h
PIR12_DMA5AIF_MASK                       equ 0080h

// Register: PIR13
#define PIR13 PIR13
PIR13                                    equ 04BBh
// bitfield definitions
PIR13_U5RXIF_POSN                        equ 0000h
PIR13_U5RXIF_POSITION                    equ 0000h
PIR13_U5RXIF_SIZE                        equ 0001h
PIR13_U5RXIF_LENGTH                      equ 0001h
PIR13_U5RXIF_MASK                        equ 0001h
PIR13_U5TXIF_POSN                        equ 0001h
PIR13_U5TXIF_POSITION                    equ 0001h
PIR13_U5TXIF_SIZE                        equ 0001h
PIR13_U5TXIF_LENGTH                      equ 0001h
PIR13_U5TXIF_MASK                        equ 0002h
PIR13_U5EIF_POSN                         equ 0002h
PIR13_U5EIF_POSITION                     equ 0002h
PIR13_U5EIF_SIZE                         equ 0001h
PIR13_U5EIF_LENGTH                       equ 0001h
PIR13_U5EIF_MASK                         equ 0004h
PIR13_U5IF_POSN                          equ 0003h
PIR13_U5IF_POSITION                      equ 0003h
PIR13_U5IF_SIZE                          equ 0001h
PIR13_U5IF_LENGTH                        equ 0001h
PIR13_U5IF_MASK                          equ 0008h
PIR13_DMA6SCNTIF_POSN                    equ 0004h
PIR13_DMA6SCNTIF_POSITION                equ 0004h
PIR13_DMA6SCNTIF_SIZE                    equ 0001h
PIR13_DMA6SCNTIF_LENGTH                  equ 0001h
PIR13_DMA6SCNTIF_MASK                    equ 0010h
PIR13_DMA6DCNTIF_POSN                    equ 0005h
PIR13_DMA6DCNTIF_POSITION                equ 0005h
PIR13_DMA6DCNTIF_SIZE                    equ 0001h
PIR13_DMA6DCNTIF_LENGTH                  equ 0001h
PIR13_DMA6DCNTIF_MASK                    equ 0020h
PIR13_DMA6ORIF_POSN                      equ 0006h
PIR13_DMA6ORIF_POSITION                  equ 0006h
PIR13_DMA6ORIF_SIZE                      equ 0001h
PIR13_DMA6ORIF_LENGTH                    equ 0001h
PIR13_DMA6ORIF_MASK                      equ 0040h
PIR13_DMA6AIF_POSN                       equ 0007h
PIR13_DMA6AIF_POSITION                   equ 0007h
PIR13_DMA6AIF_SIZE                       equ 0001h
PIR13_DMA6AIF_LENGTH                     equ 0001h
PIR13_DMA6AIF_MASK                       equ 0080h

// Register: PIR14
#define PIR14 PIR14
PIR14                                    equ 04BCh
// bitfield definitions
PIR14_CLC7IF_POSN                        equ 0001h
PIR14_CLC7IF_POSITION                    equ 0001h
PIR14_CLC7IF_SIZE                        equ 0001h
PIR14_CLC7IF_LENGTH                      equ 0001h
PIR14_CLC7IF_MASK                        equ 0002h
PIR14_C2IF_POSN                          equ 0002h
PIR14_C2IF_POSITION                      equ 0002h
PIR14_C2IF_SIZE                          equ 0001h
PIR14_C2IF_LENGTH                        equ 0001h
PIR14_C2IF_MASK                          equ 0004h
PIR14_NCO3IF_POSN                        equ 0003h
PIR14_NCO3IF_POSITION                    equ 0003h
PIR14_NCO3IF_SIZE                        equ 0001h
PIR14_NCO3IF_LENGTH                      equ 0001h
PIR14_NCO3IF_MASK                        equ 0008h

